const endStr = `你知道自己现在是在做梦还是清醒的吗？
<br><br>也许你会毫不犹豫的说出你是清醒的，不然你要怎么看这段文字呢？
<br><br>那么，你怎么知道自己是真实还是虚假的呢？
<br><br>再一次的，也许你会毫不犹豫的说出自己是真实的，因为你切切实实的活在现在，活在这里，而且正在看这段文字。
<br><br>最后一问，你存在吗，还是你从未存在过？
<br><br>我想你一定不耐烦了，如果你不存在的话，那你为什么能看到这段话呢？也许你只是想打断我说话，并告诉我，到此为止了，就到这里，给你你想要的东西，然后从这里离开。
<br><br>抱歉，我可能要让你失望了，因为我要告诉你的是，梦中的世界是存在的，而且，你眼中的现实，也有可能是梦境。
<br><br>是非对错，都是人类的定义。如果一件事对自己有利，那么它就是对的，如果一件事对自己有害，那么它就是错的。或多或少你会有这样的想法吗？道貌伟岸的伪君子们用它欺世盗名，愚昧无知的真小人们用它肆意妄为。
<br><br>同样的，真实和虚伪也都是人类的定义，人们大多认为真实的事情，就是真的；大多认为虚假的事情，就是假的。你如何能够证明你一定存在于“真实”呢？
<br><br>你可以在梦中梦见很多，噩梦和美梦就像一个又一个气泡，你可以用管道在各种各样的世界中穿梭，这里有和梦境之外一样大的宇宙。每一个人都能拥有一个梦中的世界，就像每一个人拥有一个梦外的世界一样。
<br><br>在梦的起点，有一块叫作永恒的石头，通体漆黑，深邃到任何照射到其上的光都不会被反射回来；它长宽一米，高却无法测量，并不是因为短，而是因为任何人都无法同时看到它的两端，而其他所有的测量尝试都会失败。在梦境的起点，它就在这里，梦中的一切都是由它创造，无一例外。
<br><br>人们在永恒之外建造了一座城市，理所应当的叫做永恒城，永恒城是一个延绵了不知道多长的圆盘，永恒就在圆盘中央。其他的一切，包括街道和建筑像迷宫一样排开。
<br><br>在永恒城里，房子都是由一些深色的石头——或者更像是混凝土块，人们回家不需要进门，只需要直接融入它们，这是因为每一块石头都是一块梦，它们都是由永恒所创造的。
<br><br>在梦中，人们也需要做梦，因为梦是我们的货币，只有做梦，你才能活下去。如果你不再拥有梦的能力，你就会枯竭。哦，对了，忘记和你说了，作为梦境的亲历者，你是不会受到物理伤害的，只有精神伤害才能伤害，或者杀死你。
<br><br>梦境可以是温馨和谐的，也可能是恐怖破碎的，正如不知多久前梦境的那一次大崩塌，美梦突然破碎之后，许多人的精神受到了不可逆的损伤。尽管如此，大多数时间你不会很危险，因为我会尽我所能帮助你。
<br><br>透明的管道连接着房子，你可以用它们在各个房子，也就是不同的梦里移动，尽管在外面看起来像是透明的，你在里面会看到绚丽的色彩涌动，完全和永恒城灰暗的一切相悖。
<br><br>你可能会好奇，为什么我要告诉你这些。
<br><br>因为你已经是梦的一份子了，仔细回想今天经历的一切，是否有什么不同寻常之处？那些微妙的违和感就是最好的证明。
<br><br>我看到了，你和他们不一样，也许你会看到一些不一样的梦境，写下属于你的故事，我期待你的来临。
<br><br>你最好的朋友，梦灵 那普莱纳托 敬上。`;
